УТ_для_edt.РасширениеСмарт/src/Documents/ЗаданиеНаПеревозку/ЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаданиеНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ТранспортноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КурьерЭкспедитор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаПланС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаПланПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаФактС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВремяРейсаФактПо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Распоряжения</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Перевозчик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПолучательОтправитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВремяС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВремяПо</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДополнительнаяИнформация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Доставлено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоставляетсяПолностью</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Маршрут</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КлючСвязи</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Зона</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВремяС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВремяПо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вес</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Объем</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Доставлено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДополнительнаяИнформация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АдресЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаданиеНаПеревозку/Forms/смартПроверкаВозможностиОтправкиПакетаДокументов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Элементы.КартинкаХорошо.Видимость = Ложь;
	Элементы.КартинкаПлохо.Видимость = Ложь;
	ТекстРезультатаПроверки = "Не проверено";
	
	Если Параметры.Свойство("ВидСкладаПриФормированииПакета") Тогда
		ВидСкладаПриФормированииПакета = Параметры.ВидСкладаПриФормированииПакета;
	КонецЕсли;
		
	Если Параметры.Свойство("Задание") Тогда
		
		Задание = Параметры.Задание;
		
		ЗаполнитьРаспоряжения();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыИСобытия

&НаКлиенте
Процедура ПроверитьГотовностьДокументов(Команда) 
	
	ПроверитьГотовностьДокументовНаСервере(); 
	
КонецПроцедуры  

&НаКлиенте
Процедура СформироватьдокументыУТИОтправить(Команда) 
	
	Закрыть(Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Распоряжения.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ПоказатьЗначение(, ТекущаяСтрока.Распоряжение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

&НаСервере
Процедура ПроверитьГотовностьДокументовНаСервере()
	
	ДанныеДляБП.Очистить(); 
	ДанныеДляУТ.Очистить(); 
	РезультатАнализа.Очистить();
	
	ЕстьОтклонения = Ложь;
	
	Для Каждого СтрокаРаспоряжений Из Распоряжения Цикл  
		
		СтрокаРаспоряжений.СписокРеализаций.Очистить();
		
		Если НЕ ТипЗнч(СтрокаРаспоряжений.Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРаспоряжений.РТиУ = ЕстьРеализация(СтрокаРаспоряжений); 
		
	КонецЦикла;
	
	ПолучитьРезультатФормированияПакетаПФИзБП();  
	ПолучитьРезультатФормированияПакетаПФИзУТ();  
		
	Для Каждого СтрокаРаспоряжений Из Распоряжения Цикл 
		
		Если НЕ ТипЗнч(СтрокаРаспоряжений.Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ СтрокаРаспоряжений.РТиУ Тогда
			СтрокаРаспоряжений.БП = Ложь; 
		Иначе
			СтрокаРаспоряжений.БП = ЕстьКаталог(СтрокаРаспоряжений); 
		КонецЕсли;
		
		Если НЕ СтрокаРаспоряжений.РТиУ ИЛИ НЕ СтрокаРаспоряжений.БП Тогда
			ЕстьОтклонения = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОтклонения Тогда
		
		ТекстРезультатаПроверки = "Бухгалтерия не оформила полный комплект документов!";
		Элементы.КартинкаХорошо.Видимость = Ложь;
		Элементы.КартинкаПлохо.Видимость = Истина;
		
	Иначе  
		
		ТекстРезультатаПроверки = "Задание готово к формированию пакета";  
		Элементы.КартинкаХорошо.Видимость = Истина;
		Элементы.КартинкаПлохо.Видимость = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЕстьРеализация(ДанныеСтроки)   
	
	Склад = ДанныеСтроки.Склад;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ЗаказКлиента", ДанныеСтроки.Распоряжение);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Реализация.Ссылка КАК Документ,
	|	Реализация.Организация КАК Организация,
	|	Реализация.Номер КАК Номер,
	|	Реализация.Дата КАК Дата
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Обороты(, , Регистратор, ЗаказКлиента = &ЗаказКлиента) КАК Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО Заказы.Регистратор = Реализация.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТовары
	|		ПО Заказы.Регистратор = РеализацияТовары.Ссылка
	|ГДЕ
	|	(Реализация.Склад = &Склад
	|			ИЛИ РеализацияТовары.Склад = &Склад)";
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Количество() = 0 Тогда                        
		
		Возврат Ложь;
		
	Иначе   
		
		Если ЗначениеЗаполнено(Склад) И Склад.смартАвтоматическиФормироватьДокументы Тогда
			
			Пока Выборка.Следующий() Цикл  
				
				ДанныеСтроки.СписокРеализаций.Добавить(Выборка.Документ); 
				
				Если Склад.смартФормироватьДокументыУТБП = Перечисления.смартФормироватьДокументыУТБП.БП Тогда  
					
					СтрокаТаблицы = ДанныеДляБП.Добавить(); 
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
					
				ИначеЕсли Склад.смартФормироватьДокументыУТБП = Перечисления.смартФормироватьДокументыУТБП.УТ Тогда  
					
					СтрокаТаблицы = ДанныеДляУТ.Добавить(); 
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
					
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЕстьКаталог(ДанныеСтроки)  
	
	Для Каждого Реализация Из ДанныеСтроки.СписокРеализаций Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номер", Реализация.Значение.Номер);
		СтруктураПоиска.Вставить("Дата", Реализация.Значение.Дата);
		
		НайденныеСтроки = РезультатАнализа.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Возврат Ложь;  
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере  
Процедура ПолучитьРезультатФормированияПакетаПФИзУТ()  
	
	Если ДанныеДляУТ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	//++ #Б4064 смарт: Шляпников 18.08.2025 / Интеграция с WMS. Адмирал. Контроль оформления первичных документов на стороне 1С БП. Доработка. 
	Для каждого стрДанные Из ДанныеДляУТ Цикл
		Если ЗначениеЗаполнено(стрДанные.Документ) Тогда
			СтрокаТаблицы = РезультатАнализа.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, стрДанные);
		КонецЕсли;
	КонецЦикла;
	//ТаблицаДляУТ = ДанныеДляУТ.Выгрузить();
	//
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ВходящиеДанные", ТаблицаДляУТ);
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ВходящиеДанные.Документ КАК Документ
	//|ПОМЕСТИТЬ ТаблицаПараметров
	//|ИЗ
	//|	&ВходящиеДанные КАК ВходящиеДанные
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СформированныеПакетыПФ.Документ.Номер КАК Номер,
	//|	СформированныеПакетыПФ.Документ.Дата КАК Дата
	//|ИЗ
	//|	РегистрСведений.смартСформированныеПакетыПФ КАК СформированныеПакетыПФ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПараметров КАК ТаблицаПараметров
	//|		ПО СформированныеПакетыПФ.Документ = ТаблицаПараметров.Документ
	//|ГДЕ
	//|	СформированныеПакетыПФ.Документ.Проведен 
	//|	И СформированныеПакетыПФ.ПакетСформирован"; 
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//			
	//	СтрокаТаблицы = РезультатАнализа.Добавить();
	//	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
	//			
	//КонецЦикла;
	//-- #Б4064 смарт: Шляпников 18.08.2025
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаспоряжения() 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задание", Задание);
	
	Запрос.УстановитьПараметр("НаименованиеСклада", СтрШаблон("%%%1%%", ВидСкладаПриФормированииПакета));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Задания.Распоряжение КАК Распоряжение,
	|	Задания.Склад КАК Склад,
	|	ЛОЖЬ КАК РТиУ,
	|	ЛОЖЬ КАК БП
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК Задания
	|ГДЕ
	|	Задания.Ссылка = &Задание
	|	И Задания.Склад В (&Склады)";
	
	Если ВидСкладаПриФормированииПакета = "Адмирал" Тогда
		Запрос.УстановитьПараметр("Склады", ПолучитьСкладыАдмирал());
	Иначе
		Запрос.УстановитьПараметр("Склады", ПолучитьСкладыАтлант());
	КонецЕсли;
	
	Распоряжения.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере  
Процедура ПолучитьРезультатФормированияПакетаПФИзБП()  
	
	ТаблицаДляБП = ДанныеДляБП.Выгрузить();
	ТаблицаДляБП.Свернуть("Организация, Номер, Дата");
	
	ТаблицаОрганизаций = ТаблицаДляБП.Скопировать();
	ТаблицаОрганизаций.Свернуть("Организация");
	
	Для Каждого СтрокаОрганизаций Из ТаблицаОрганизаций Цикл 
		
		ВходящиеДанные = Новый ТаблицаЗначений;
		ВходящиеДанные.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(11)));
		ВходящиеДанные.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));  
		
		Для Каждого СтрокаДанных Из ТаблицаДляБП Цикл
		
			Если СтрокаОрганизаций.Организация = СтрокаДанных.Организация Тогда
				
				СтрокаТаблицы = ВходящиеДанные.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДанных);  
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", СтрокаОрганизаций.Организация);
		СтруктураПараметров.Вставить("ВходящиеДанные", ВходящиеДанные);
		
		Результат = смартОбщегоНазначения.СостоянияСохраненияПечатныхФормРеализацийВБП(СтруктураПараметров);
		
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Результат;
			Сообщение.Сообщить();
			
		Иначе
			
			Для Каждого СтрокаРезультата Из Результат Цикл
				
				СтрокаТаблицы = РезультатАнализа.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаРезультата);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСкладыАдмирал()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Наименование ПОДОБНО ""%Адмирал%""";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Функция ПолучитьСкладыАтлант()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.смартНастройкаОбменомСАтлант = ЗНАЧЕНИЕ(ПланОбмена.смартОбменСоСкладомАтлант.ПустаяСсылка)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции



#КонецОбласти
